[
    {
        "id": 14,
        "name": "the wild oasis",
        "shortDescription": "Streamlined cabin rental management. React app with Supabase integration.",
        "description": "Elevate your cabin rental business with our React-based web application. Seamlessly interfacing with Supabase, this app empowers you to effortlessly manage reservations, check-ins, check-outs, user creation, and reservation status changes. The comprehensive system also offers real-time statistics, graphing income, reservations, check-ins, and check-outs. Protected by a robust authentication system, only authorized personnel can access the app. Powered by React Query and asynchronous processes, the app optimizes data handling, while React Hook Form ensures smooth user interactions. The inclusion of Recharts, date-fns, and error boundaries enhances the app's visual appeal, usability, and reliability. Seamless navigation is guaranteed with React Router, and the use of Styled Components enhances aesthetic flexibility. Dark mode and filtering features further enhance user experience, while Vite ensures fast, modern performance. Hosted on Vercel, the application combines accessibility and visual appeal. Whether you're managing reservations or analyzing financials, our app provides a comprehensive, responsive solution for streamlined cabin rental management.",
        "projectLink": "https://the-wild-oasys-v1.vercel.app/",
        "difficultyLevel": "",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fthe-wild-oasys.png?alt=media&token=3c1cacba-faa9-45e7-b6c3-96b75afe674d",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "08/08/2023",
        "technology": [
            "react",
            "reactquery",
            "supabase",
            "reactrouter",
            "reacthookform",
            "styledcomponents",
            "vite",
            "html5",
            "eslint",
            "vercel",
            "git"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "recharts",
            "date-fns",
            "react-error-boundary",
            "react-hook-form",
            "protectedRoute",
            "useContext",
            "ES6",
            "react-hot-toast",
            "user management",
            "darkMode",
            "filter"
        ]
    },
    {
        "id": 13,
        "name": "world wise",
        "shortDescription": "World-travel mapping. React app with Auth0, Firebase, and interactive maps",
        "description": "Embark on a personalized world-travel journey with our React-powered web application. Seamlessly integrating Auth0 for secure registration and login, the app offers various login options for user convenience. Upon accessing the application, users are greeted with an interactive world map powered by Leaflet. With a click, users can mark the places they've visited, adding dates and optional notes. The app seamlessly synchronizes this data with Firebase, ensuring accessibility across devices. Utilizing React Query and asynchronous operations, the app optimizes data retrieval and display. Protected routes, Suspense, and lazy loading enhance performance and user experience. Hosted on Vercel and adorned with Google Fonts, this app combines functionality and aesthetics. Whether you're an avid traveler or looking to document your journeys, our application delivers a user-friendly, responsive platform to showcase your adventures and revisit your cherished memories.",
        "projectLink": "https://worldwise-v2.vercel.app/",
        "difficultyLevel": "advanced",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fworldwise.png?alt=media&token=99b71879-dc9e-49a3-a3dd-ea8f7f6f20f5",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "08/17/2023",
        "technology": [
            "react",
            "reactquery",
            "auth0",
            "firebase",
            "leaflet",
            "reactrouter",
            "cssmodules",
            "dotenv",
            "vite",
            "html5",
            "eslint",
            "vercel",
            "git"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "geoLocation",
            "Suspense",
            "lazy",
            "protectedRoute",
            "useContext",
            "ES6"
        ]
    },
    {
        "id": 12,
        "name": "react shopping cart",
        "shortDescription": "Effortless pizza ordering",
        "description": "Indulge in seamless pizza ordering through our React-powered web application. Designed with Vite, Redux, React Router, and enhanced by Tailwind CSS, this app empowers pizzerias to offer customers an intuitive and rapid ordering experience. The user can effortlessly browse and select items from an external API-driven catalog. With quantity customization and dynamic product adjustments, users can tailor their orders to perfection. Upon providing contact details, a unique order ID is generated, enabling users to track their order's status in real time on the same page. Leveraging technologies like fetch, geoLocation, and ES6, the app optimizes asynchronous operations and enhances user engagement. The application's responsive design guarantees a flawless experience across devices. Hosted on Netlify and accentuated by Google Fonts, this app fuses practicality with visual appeal. Whether you're a pizza aficionado or simply craving a quick and user-friendly way to order your favorite slice, our application delivers an uncomplicated, seamless, and responsive solution",
        "projectLink": "https://pizza-shopping-kart.netlify.app/",
        "difficultyLevel": "advanced",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fshop-kart.png?alt=media&token=b625c24b-7dc5-465e-87f2-97f23607d1ce",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "08/17/2023",
        "technology": [
            "react",
            "redux",
            "reactrouter",
            "tailwindcss",
            "css3",
            "html5",
            "vite",
            "eslint",
            "netlify",
            "git",
            "googlefonts"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "geoLocation",
            "ES6",
            "responsive"
        ]
    },
    {
        "id": 11,
        "name": "JML analyzer",
        "shortDescription": "Data analysis app. Node, Express, MongoDB for advanced analytics.",
        "description": "Experience powerful data analysis with our Node and Express-based web application. Seamlessly integrated with MongoDB, this app facilitates creation and storage of analysis parameters in a database. By effortlessly handling Excel files and leveraging advanced libraries like 'xlsx', the app processes uploaded files according to selected parameters. The application's dynamic Express-Handlebars templates offer user-friendly interfaces for data input and display. Hosted on Vercel, the app ensures accessibility and reliable performance. Under the hood, technologies like 'express-session', 'fs-extra', 'mongoose', 'multer', and 'nanoid' combine to streamline data handling and ensure secure file uploads. With CSS3 and HTML5 enhancing visual aesthetics, our app delivers detailed analysis reports with summaries derived from meticulously processed data. Whether you're an analyst or a data enthusiast, our application empowers you to unravel insights from complex data sets, all within an intuitive and responsive environment.",
        "projectLink": "https://jml-analizer-github-io.vercel.app/",
        "difficultyLevel": "advanced",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fjml-analyzer.png?alt=media&token=b4ad93c9-3389-4a13-a155-e21c19fad1f0",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "03/20/2023",
        "technology": [
            "node",
            "express",
            "mongodb",
            "handlebars",
            "dotenv",
            "css3",
            "html5",
            "vercel",
            "nodemon",
            "git"
        ],
        "tags": [
            "express-handlebars",
            "express-session",
            "fs-extra",
            "mongoose",
            "multer",
            "nanoid",
            "xlsx"
        ]
    },
    {
        "id": 10,
        "name": "weather app",
        "shortDescription": "Swift weather forecasts. Real-time React weather app.",
        "description": "Stay ahead of changing weather conditions with our React-based web application. Crafted using Create React App, CSS3, and HTML5, this user-friendly app empowers you to swiftly access 5-day weather forecasts for any global location. Leveraging the power of two external libraries and the prowess of asynchronous operations, the app delivers real-time weather insights that adapt to your needs. Harnessing state management tools like useContext, useEffect, and useState, the app ensures smooth interactivity and accurate data presentation. Seamlessly responsive and hosted on Netlify, this application guarantees accessibility and exceptional performance. Whether you're planning outdoor activities or simply staying informed, our app provides instant, reliable meteorological information at your fingertips, all within an intuitive and visually appealing interface.",
        "projectLink": "https://weather-app-v4.netlify.app/",
        "difficultyLevel": "intermediate",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fweather-app.png?alt=media&token=05bf348e-5488-4816-92b6-a9a8a12573da",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "07/22/2023",
        "technology": [
            "react",
            "createReactApp",
            "css3",
            "html5",
            "netlify",
            "git"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "useContext",
            "useEffect",
            "useState",
            "ES6",
            "responsive"
        ]
    },
    {
        "id": 9,
        "name": "open trivia",
        "shortDescription": "Engaging React quiz game. Responsive, knowledge-testing fun",
        "description": "Embark on an enriching knowledge journey with our React-based quiz application. Tailor your experience by selecting the number of questions, choosing from over 20 diverse knowledge categories, and setting your desired difficulty level. As you progress, the app tracks your score and displays the number of questions you've answered. Seamlessly crafted with React, Vite, CSS3, and HTML5, the app empowers users with an interactive and intuitive interface. Utilizing advanced features like useContext, useEffect, and useReducer, the app ensures efficient state management and asynchronous operations. Fully responsive design guarantees a seamless experience across devices, while FontAwesome icons enhance visual clarity. The app, hosted on Netlify, promises accessibility and smooth performance. Whether you're a trivia enthusiast or simply looking to test your knowledge, our application delivers engaging and educational entertainment that adapts to your preferences and challenges your intellect.",
        "projectLink": "https://open-trivia-v2.netlify.app/",
        "difficultyLevel": "intermediate",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fopen-trivia.png?alt=media&token=2a9d344a-828b-462b-9674-5a47c18789ac",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "07/22/2023",
        "technology": [
            "react",
            "vite",
            "css3",
            "html5",
            "netlify",
            "fontawesome",
            "git"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "useContext",
            "useEffect",
            "useReducer",
            "ES6",
            "responsive"
        ]
    },
    {
        "id": 8,
        "name": "pet adoption",
        "shortDescription": "Flask-powered pet adoption. Responsive, user-friendly, adoption platform",
        "description": "Experience seamless pet adoption with our Flask-powered web application. Discover a curated list of pets available for adoption, and contribute to the cause by offering your furry friend for adoption. The app enables users to send adoption requests, with notifications sent to the pet owner's email. Crafted with Python, Flask, Jinja, and SQLAlchemy, the app harnesses the power of asynchronous operations and responsive design. Leveraging SQLite as the relational database and integrating technologies like WTForms and Werkzeug, the app ensures secure data management and user authentication. The dynamic interface harmoniously blends CSS3, HTML5, and Jinja templating for an intuitive experience. Hosted on Vercel, the application guarantees accessibility and seamless performance. Whether you're seeking a new companion or looking to rehome your pet, our application provides a user-friendly and responsive platform for connecting pet lovers and providing a loving home to animals in need.",
        "projectLink": "https://pet-adoption-github-io.vercel.app/",
        "difficultyLevel": "intermediate",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fpet-adoption.JPG?alt=media&token=49b21c3b-83af-4561-ac61-c1150f31d52f",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "08/20/2022",
        "technology": [
            "python",
            "flask",
            "vercel",
            "jinja",
            "SQLite",
            "css3",
            "html5",
            "git"
        ],
        "tags": [
            "asynchronous",
            "classes",
            "data base",
            "login",
            "SQLAlchemy",
            "WTForms",
            "Werkzeug",
            "responsive"
        ]
    },
    {
        "id": 7,
        "name": "maphy",
        "shortDescription": "Geo-based game. Click world map, earn points. Responsive fun.",
        "description": "Embark on an interactive global journey with our captivating geography web game. Powered by JavaScript, CSS3, and HTML5, this engaging application utilizes the Leaflet API to render an interactive world map. Asynchronously programmed, it randomly selects a country for users to locate by clicking on the map. Earn points for each successful guess and progress through levels categorized by country popularity. In case of a miss, the app provides a summary of points earned and displays the correct location, encouraging continuous learning. With features like pagination, asynchronous 'fetch', and GeoLocation integration, the game offers seamless navigation and real-time engagement. Embracing ES6 features, modular design, and Font Awesome icons, the app combines functionality and aesthetics. Hosted on Netlify and enhanced by Google Fonts, this web game guarantees responsive enjoyment across devices. Whether you're a geography enthusiast or simply seeking an entertaining challenge, this app invites you to explore the world, one click at a time.",
        "projectLink": "https://maphy.netlify.app/",
        "difficultyLevel": "intermediate",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fmaphy.png?alt=media&token=c51fa769-502b-474e-95f9-9dd72ca28ce3",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "06/06/2023",
        "technology": [
            "javascript",
            "css3",
            "html5",
            "leaflet",
            "netlify",
            "fontawesome",
            "googlefonts",
            "git"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "classes",
            "promises",
            "modules",
            "ES6",
            "pagination",
            "geoLocation",
            "querySelector"
        ]
    },
    {
        "id": 6,
        "name": "dishHunt",
        "shortDescription": "Explore, cook, and save recipes.",
        "description": "Uncover a world of culinary delights with our versatile recipe application. Utilizing an external API, it empowers users to discover over 1 million recipes by entering a single ingredient. Dive into recipes with detailed instructions, preparation methods, and the ability to adjust serving sizes. Seamlessly calculating ingredient quantities for modified servings, the app ensures a user-friendly cooking experience. Save your favorite recipes for quick access in the bookmark section and unleash your inner chef by creating and storing your unique culinary creations. The application's responsiveness guarantees a seamless journey on various devices. Powered by technologies like JavaScript, Vite, CSS3, and HTML5, this app seamlessly harmonizes asynchronous functionality, modular design, and ES6 features. The integration of pagination, localStorage, and Font Awesome icons enhances both convenience and visual aesthetics. Whether you're a seasoned chef or an amateur cook, this app elevates your culinary adventures, ensuring you're well-equipped to create, explore, and savor.",
        "projectLink": "https://dishhunt.netlify.app/",
        "difficultyLevel": "intermediate",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fdish-hunt.png?alt=media&token=fec3ffa8-6686-483a-8670-cf6deceb0dde",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "06/05/2023",
        "technology": [
            "javascript",
            "vite",
            "css3",
            "html5",
            "netlify",
            "fontawesome",
            "googlefonts",
            "git"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "classes",
            "inheritance",
            "promises",
            "modules",
            "MVC",
            "ES6",
            "AJAX",
            "pagination",
            "localStorage",
            "responsive"
        ]
    },
    {
        "id": 5,
        "name": "usePopcorn",
        "shortDescription": "Discover, rate, and track movies. Responsive React movie app",
        "description": "Embark on a cinematic journey with our React-powered movie application. Seamlessly integrating an external API, the app grants access to over 10 million movies. Delve into the immersive world of films as you explore duration, plot, actors, and ratings. Mark movies as watched and assign personal ratings for a customized experience. The real-time search feature refines results with each character input, optimized through asynchronous 'fetch' calls and 'abortController' to prevent overload. The app's dynamic nature is enriched by 'useState', 'useRef', 'useEffect', and custom hooks, ensuring seamless interactions and minimal resource strain. Responsive design guarantees a consistent experience across devices. With features like pagination, localStorage integration, and Font Awesome icons, our application enhances both utility and visual appeal. Engage with movies like never before, seamlessly navigating through cinematic treasures and personalizing your viewing history with ease.",
        "projectLink": "https://usepopcorn-v2.netlify.app/",
        "difficultyLevel": "intermediate",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2FusePopCorn.png?alt=media&token=1a0b76a6-a40c-4dec-bcc1-7e555381c48a",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "06/22/2023",
        "technology": [
            "react",
            "createReactApp",
            "css3",
            "html5",
            "netlify",
            "fontawesome",
            "git"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "abortController",
            "useState",
            "useRef",
            "useEffect",
            "customHooks",
            "pagination",
            "localStorage",
            "responsive"
        ]
    },
    {
        "id": 1,
        "name": "bank app",
        "shortDescription": "Manage finances, transactions & credits.",
        "description": "This platform also boasts remarkable interactive capabilities. Users can effortlessly initiate money transfers among registered accounts, review real-time transaction histories, and even perform the decisive action of account closure. The inclusion of an automatic logout feature in response to periods of inactivity adds an extra layer of security and convenience to the user journey. JavaScript, CSS3, and HTML5 constitute the fundamental pillars of this application. The project seamlessly integrates an array of technologies, including the sophisticated use of querySelector, eventListener, setInterval, and clearInterval. These elements not only underscore your prowess in crafting responsive designs, but also illuminate your command over dynamic functionalities that enhance user experiences. Within this innovative framework, advanced JavaScript functions such as map, some, splice, and findIndex shine. They enable intelligent and efficient data manipulation, facilitating real-time transaction monitoring and insightful financial analysis. Meanwhile, the meticulous application of reduce, find, and forEach functions ensures that precision and consistency characterize every operation.",
        "projectLink": "https://bankappl.netlify.app/",
        "difficultyLevel": "beginner",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fbankapp.png?alt=media&token=b38976fe-24cd-486c-a4d8-4766f51c7bde",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "06/18/2023",
        "technology": [
            "javascript",
            "css3",
            "html5",
            "netlify",
            "git"
        ],
        "tags": [
            "querySelector",
            "setInterval",
            "clearInterval",
            "math",
            "eventListener",
            "date",
            "map",
            "some",
            "splice",
            "findIndex",
            "reduce",
            "find",
            "unshift",
            "forEach",
            "responsive"
        ]
    },
    {
        "id": 2,
        "name": "poke api",
        "shortDescription": "Random Pokémon info cards, responsive.",
        "description": "Delve into the captivating realm of Pokémon through our JavaScript-driven application, seamlessly integrating an external API to present an array of Pokémon information. With each page load or refresh, a new Pokémon card materializes, allowing you to explore the vast Pokémon universe in an engaging manner. The platform's responsive design guarantees an optimal experience across devices, be it on desktop or mobile. Additionally, users can search for specific Pokémon by entering their IDs, swiftly summoning their corresponding cards. The app employs asynchronous programming and 'fetch' API for real-time data retrieval, while JavaScript's 'querySelector' and 'eventListener' enhance interactivity. Hosted on Netlify, the application seamlessly combines CSS3 and HTML5, with Font Awesome and Google Fonts contributing to its visual appeal. Embrace the thrill of discovering diverse Pokémon, all within the confines of a single, user-friendly interface.",
        "projectLink": "https://frontendpokeapi.netlify.app/",
        "difficultyLevel": "beginner",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fpokeapi.png?alt=media&token=f158d1a8-5ad1-4518-97ce-7c4e13ab0254",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "02/03/2023",
        "technology": [
            "javascript",
            "css3",
            "html5",
            "netlify",
            "fontawesome",
            "googlefonts",
            "git"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "html fragment",
            "querySelector",
            "eventListener",
            "math",
            "responsive"
        ]
    },
    {
        "id": 3,
        "name": "quote generator",
        "shortDescription": "Random quotes displayed instantly.",
        "description": "Experience a constant stream of inspiration with our dynamic application. Powered by JavaScript, CSS3, and HTML5, this platform seamlessly connects to an external API, delivering a fresh quote to your screen each time you load or refresh the page. Whether you seek motivation, wisdom, or laughter, our app ensures that every interaction leaves you with a new perspective. Embracing responsive design principles, the app adapts effortlessly to diverse devices, offering an optimal experience on both desktop and mobile. The seamless blend of asynchronous programming, 'fetch' API, 'querySelector', and 'eventListener' results in instant, real-time quote retrieval and interaction. With the app hosted on Netlify, the experience is smooth, reliable, and ever-enlightening. Elevate your day with the spontaneity and wisdom of our application, uniting the power of technology with a touch of randomness.",
        "projectLink": "https://jsquotegenerator.netlify.app/",
        "difficultyLevel": "beginner",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Fquote-generator.png?alt=media&token=3fd6a828-bcae-40be-b9fc-9f62976794d9",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "06/06/2023",
        "technology": [
            "javascript",
            "css3",
            "html5",
            "netlify",
            "git"
        ],
        "tags": [
            "asynchronous",
            "fetch",
            "querySelector",
            "eventListener",
            "responsive"
        ]
    },
    {
        "id": 4,
        "name": "todo app",
        "shortDescription": "Task manager with localStorage",
        "description": "Elevate your productivity with our intuitive task management application. Built with JavaScript, CSS3, and HTML5, it empowers you to effortlessly create, track, and manage tasks. Craft detailed task descriptions and set due dates to ensure nothing slips through the cracks. Using localStorage, tasks persist even after refreshing the page. The interface displays tasks in a user-friendly list, offering quick access to edit or remove them. With the power of 'querySelector', 'localStorage', 'date', and 'eventListener', the app delivers real-time updates and seamless interactions. Check off completed tasks or revert them to pending status, fostering a sense of accomplishment. The dynamic integration of 'split', 'filter', and 'forEach' optimizes task organization and display. Hosted on Netlify, this application merges convenience and accessibility, while Font Awesome icons enhance visual clarity. Dive into a streamlined workflow, where task management meets responsive design for an unparalleled experience.",
        "projectLink": "https://jstodoappl.netlify.app/",
        "difficultyLevel": "beginner",
        "mainPicture": "https://firebasestorage.googleapis.com/v0/b/storage-images-4b0f3.appspot.com/o/portfolio-projects-imgs%2Ftodo-app.png?alt=media&token=f096c211-4579-4a62-b3b4-5afabc03c4a5",
        "likes": 0,
        "loves": 0,
        "lastUpdate": "05/04/2023",
        "technology": [
            "javascript",
            "css3",
            "html5",
            "netlify",
            "fontawesome",
            "git"
        ],
        "tags": [
            "querySelector",
            "localStorage",
            "date",
            "eventListener",
            "split",
            "filter",
            "forEach",
            "responsive"
        ]
    }
]